CF/Enums/ВидыАнализаМонитора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыАнализаМонитора</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КоличествоЧеков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СреднийЧек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстаткиДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстаткиДСККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДвиженияДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажиПоКонтрагентам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадолженностьПоставщикам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Enums/ВидыАнализаМонитора/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВидыАнализаМонитораПоУмолчанию() Экспорт
	
	РазделыПоУмолчанию = Новый Массив;
	РазделыПоУмолчанию.Добавить(КоличествоЧеков);
	РазделыПоУмолчанию.Добавить(СреднийЧек);
	РазделыПоУмолчанию.Добавить(СуммаПродаж);
	РазделыПоУмолчанию.Добавить(ОстаткиДСККМ);
	РазделыПоУмолчанию.Добавить(ОстаткиДС);
	РазделыПоУмолчанию.Добавить(ПродажиПоКонтрагентам);
	РазделыПоУмолчанию.Добавить(ДвиженияДС);
	РазделыПоУмолчанию.Добавить(ЗадолженностьПоставщикам);
	
	Возврат РазделыПоУмолчанию;
	
КонецФункции



#КонецОбласти

#КонецЕсли
